```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_service.main must be replaced
-/+ resource "google_project_service" "main" {
      ~ id                 = "playground-1a136/playground.ashdavies.dev" -> (known after apply)
      ~ service            = "playground.ashdavies.dev" -> "api.ashdavies.dev" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloud-run-endpoint.google_endpoints_service.main must be replaced
-/+ resource "google_endpoints_service" "main" {
      ~ apis           = [
          - {
              - methods = [
                  - {
                      - name          = "GetAssetLinks"
                      - request_type  = "type.googleapis.com/google.protobuf.Empty"
                      - response_type = "type.googleapis.com/google.protobuf.Value"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - name          = "GetUpcomingEvents"
                      - request_type  = "type.googleapis.com/GetUpcomingEventsRequest"
                      - response_type = "type.googleapis.com/google.protobuf.ListValue"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - name          = "AggregateEvents"
                      - request_type  = "type.googleapis.com/google.protobuf.Empty"
                      - response_type = "type.googleapis.com/google.protobuf.Value"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - name          = "SignIn"
                      - request_type  = "type.googleapis.com/SignInRequest"
                      - response_type = "type.googleapis.com/AuthResult"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - name          = "CreateToken"
                      - request_type  = "type.googleapis.com/CreateTokenRequest"
                      - response_type = "type.googleapis.com/AppCheckToken"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - name          = "VerifyToken"
                      - request_type  = "type.googleapis.com/VerifyTokenRequest"
                      - response_type = "type.googleapis.com/DecodedToken"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - name          = "HelloWorld"
                      - request_type  = "type.googleapis.com/google.protobuf.Empty"
                      - response_type = "type.googleapis.com/google.protobuf.Value"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - name    = "1.playground_ashdavies_dev"
              - version = "1.0.0"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ config_id      = "2024-08-06r0" -> (known after apply)
      ~ dns_address    = "playground.ashdavies.dev" -> (known after apply)
      ~ endpoints      = [
          - {
              - name    = "playground.ashdavies.dev"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ id             = "playground.ashdavies.dev" -> (known after apply)
      ~ service_name   = "playground.ashdavies.dev" -> "api.ashdavies.dev" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloud-run-endpoint.null_resource.main must be replaced
-/+ resource "null_resource" "main" {
      ~ id       = "4475904511356956256" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "config_id"   = "2024-08-06r0" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->